"""Задача 1: Найдите сумму цифр трехзначного числа.
123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0)"""

num = 100
n1 = num//100
n2 = num//10%10
n3 = num%10
summa = n1 + n2 + n3
print(summa)